import 'dart:math';// імпорт бібліотеки для математичних функцій
void main() {
     const svalue = -1.0;// початкове значення
     const fvalue = 6.0;// фінальне значення
     const step = 0.25; // значення кроку
     double func; // значення фунції на даний момент виконання циклу
     double res = 0; // сума значень функції
     print("Завдання: провести табулювання функції y=x^2 - 4 + x у проміжку [-1, 6] з кроком 0.25 з допомогою циклу for");
     print("Додаткове завдання: вивести суму значень функції");
     
     for(double x = svalue; x <= fvalue; x += step){
       func = pow(x, 2) - 4 + x;// табулювання функції

       res += func; // додавання всіх значень функції
     }
     print("Сума значень функції: $res"); //вивід суми значень функції з використанням форматування рядку
}