import "tab.dart";// Імпортування класу tab.dart
void main()
{
  final processor = Tab(0.5);// створення екземпляру класу(в дужках вказується крок табуляції)

  print("Завдання: провести табуляцію функції y=16/x^2 в проміжку [-5, 5] з використанням циклу while");
  print("Додаткове завдання 1: Вивести мінімальне та максимальне значення функції");
  print("Додаткове завдання 2: крок табулювання вказується у конструкторі; діапазон табулювання за замовчуванням [-5, 5]; діапазон табулювання може бути змінений методом `setRange`, який приймає 2 значення: “з” та “по” включно");
  
  //processor.setRange(-10, 10); // змінення проміжку значень табуляції(мін. значення, макс. значення)
  // отримання значень проміжку
  double vF = processor.valueFrom;
  double vT = processor.valueTo;
  print("Заданий проміжок: $vF, $vT");
  processor.runTab(); // запуск програми
  final min = processor.min;// отримання мінімального значення
  final max = processor.max;// отримання максимального значення
  print("Мінімальне значення функції: $min");
  print("Мінімальне значення функції: $max");
}